app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.save!
---
INSERT INTO "users" ("name", "username", "password_digest", "created_at", "updated_at", "email") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"